In [ ]:
# import libraries 
import pandas as pd 
import numpy as np 
import seaborn as sns 
import matplotlib.pyplot as plt

In [13]:
ks = sns.load_dataset("titanic")
ks.dropna(subset=["deck"], axis=0 , inplace = True)

In [14]:
ks.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [17]:
ks= ks.dropna()

In [18]:
ks.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [19]:
ks["age"].shape

(182,)

In [21]:
bins = np.linspace(min(ks["age"]), max(ks["age"]), 4)
bins

array([ 0.92, 27.28, 53.64, 80.  ])

In [23]:
age_groups = ["bachay", "jawan", "Boorhay"]
ks["age"] = pd.cut(ks["age"], bins, labels= age_groups ,include_lowest=True )
ks["age"]

1        jawan
3        jawan
6      Boorhay
10      bachay
11     Boorhay
        ...
871      jawan
872      jawan
879    Boorhay
887     bachay
889     bachay
Name: age, Length: 182, dtype: category
Categories (3, object): ['bachay' < 'jawan' < 'Boorhay']

In [24]:
ks.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,jawan,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,jawan,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,Boorhay,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,bachay,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,Boorhay,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True